## Terraform Plan 📋

<details>
<summary>Show Plan</summary>

```terraform
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 9b4c2fc3): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251107232722194000000001]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 1370cedc): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251107211902246300000002]
module.networking.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b28cd11901077bed]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 59924ca9): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251108010030574800000001]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Reading...
module.networking.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.container_registry.aws_ecr_repository.this: Refreshing state... [id=ml-platform-api]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object a6609c63): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251107100719811900000001]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 4a874979): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251107223704522800000001]
module.eks_cluster.aws_iam_role.node_group: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003]
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.networking.module.vpc.data.aws_partition.current[0]: Reading...
module.networking.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.security.data.aws_caller_identity.current: Reading...
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.networking.module.vpc.data.aws_region.current[0]: Reading...
module.networking.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-west-2]
module.eks_cluster.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ml-platform-dev/cluster]
module.networking.data.aws_region.current: Reading...
module.networking.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.eks_cluster.module.eks.aws_iam_role.this[0]: Refreshing state... [id=ml-platform-dev-cluster-20251107084424449600000002]
module.security.data.aws_caller_identity.current: Read complete after 0s [id=984479408136]
module.networking.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251107084424449300000001]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::984479408136:assumed-role/GitHubActions-AssumeRoleForActions/GitHubActions-TF-Plan-19189147019]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_cni_policy: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ec2_container_registry_read_only: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_worker_node_policy: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ssm_managed_instance_core[0]: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks_cluster.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ml-platform-dev-cluster-20251107084424449600000002/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.container_registry.aws_ecr_lifecycle_policy.this: Refreshing state... [id=ml-platform-api]
module.networking.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b072b47ed33e75cb]
module.networking.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-0649779911242c79e]
module.networking.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0b28cd11901077bed]
module.networking.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023f6f8bd183715f1]
module.networking.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08d5be8c294def947]
module.networking.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0581f8b231b85610b]
module.eks_cluster.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bc07a41d993fe03f]
module.networking.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a662ceb577046bab]
module.eks_cluster.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-06cbfde16551edb9f]
module.networking.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06381a8f015282e7e]
module.networking.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-069b47da28fb709ea]
module.networking.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f3b163dd6c42977f]
module.networking.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c3f20f05e29e318]
module.networking.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03c43aaf09a5d5aa8]
module.networking.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d59eaf7fdf6f2ce4]
module.networking.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cbedfc18a7cb1504]
module.networking.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-08c3e80a9eb8fcdcc]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=506894606]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1583704121]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-3393529018]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_to_node_all_traffic"]: Refreshing state... [id=sgrule-1790725929]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1101652775]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4198157270]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-2486903782]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_ntp"]: Refreshing state... [id=sgrule-2131426856]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_tcp"]: Refreshing state... [id=sgrule-698715995]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_kubelet"]: Refreshing state... [id=sgrule-1570153589]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_udp"]: Refreshing state... [id=sgrule-3608107983]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1481414802]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_node_ports"]: Refreshing state... [id=sgrule-46176996]
module.networking.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-2025110708443931220000000a]
module.networking.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02fb298daa06fc716]
module.networking.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023f6f8bd183715f11080289494]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3686459932]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-1685426579]
module.networking.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08b88cccde42030be]
module.networking.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f0d6877668c59437]
module.networking.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05e1942344f710270]
module.networking.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f4f41e22813c1a3]
module.networking.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03a464da5f9a96e79]
module.networking.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0fbd3091ff38c2055]
module.networking.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251107084424449300000001/arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-2025110708443931220000000a]
module.networking.aws_vpc_endpoint.ec2: Refreshing state... [id=vpce-017bb5abee278095f]
module.networking.aws_vpc_endpoint.autoscaling: Refreshing state... [id=vpce-029b860a2bc7afdfb]
module.networking.aws_vpc_endpoint.sts: Refreshing state... [id=vpce-0ffc51717574c4e9e]
module.networking.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-02f287c14304a65d8]
module.networking.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-02f3f8d1fbe940f6a]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03b7ac054650813d5]
module.eks_cluster.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ml-platform-dev]
module.networking.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ddb4228afa201016]
module.networking.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cbedfc18a7cb15041080289494]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-066a525484cfe5b64,Cluster]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-066a525484cfe5b64,Environment]
module.eks_cluster.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-11-07T08:54:48Z]
module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/4179F25B85412BF5DFBAA8BE4E69CDC2]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1444722670864172653]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-08fdb290be690713d]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.34/amazon-linux-2023/x86_64/standard/recommended/release_version]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0]: Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251108034916452400000008]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251108034916452400000008/46cd30ca-942d-9c48-bd91-c209fc82f662"
        id                     = "ml-platform-dev:ml-platform-dev-ng-20251108034916452400000008"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-ml-platform-dev-ng-20251108034916452400000008-46cd30ca-942d-9c48-bd91-c209fc82f662"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ng"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.networking.aws_security_group.vpc_endpoints will be updated in-place
  ~ resource "aws_security_group" "vpc_endpoints" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound - required for VPC endpoints to reach AWS services"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0649779911242c79e"
        name                   = "ml-platform-dev-vpc-vpc-endpoints-sg"
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-vpc-vpc-endpoints-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-west-2.amazonaws.com/id/4179F25B85412BF5DFBAA8BE4E69CDC2"
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "ml-platform-dev"
        name                          = "ml-platform-dev"
        tags                          = {
            "Cluster"               = "ml-platform-dev"
            "Environment"           = "dev"
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ]
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/4179F25B85412BF5DFBAA8BE4E69CDC2"
        tags            = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-eks-irsa"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251108034916452400000008/46cd30ca-942d-9c48-bd91-c209fc82f662" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "ml-platform-dev:ml-platform-dev-ng-20251108034916452400000008" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "ml-platform-dev-ng-20251108034916452400000008" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251108034916452400000008-46cd30ca-942d-9c48-bd91-c209fc82f662"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ng"
        }
        # (11 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-08fdb290be690713d"
          ~ name    = "main-2025110708544931700000000b" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ node_repair_config (known after apply)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 1370cedc) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_ARM_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251107211902246300000002/24cd3017-f1bb-e282-199c-ef376e33aeaf" -> null
      - capacity_type          = "SPOT" -> null
      - cluster_name           = "ml-platform-dev" -> null
      - disk_size              = 0 -> null
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251107211902246300000002" -> null
      - instance_types         = [
          - "t4g.medium",
          - "t4g.small",
          - "t4g.large",
        ] -> null
      - labels                 = {
          - "node-lifecycle" = "spot"
        } -> null
      - node_group_name        = "ml-platform-dev-ng-20251107211902246300000002" -> null
      - node_group_name_prefix = "ml-platform-dev-ng-" -> null
      - node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251107084424450100000003" -> null
      - region                 = "us-west-2" -> null
      - release_version        = "1.34.1-20251103" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251107211902246300000002-24cd3017-f1bb-e282-199c-ef376e33aeaf"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-06381a8f015282e7e",
          - "subnet-069b47da28fb709ea",
          - "subnet-0a662ceb577046bab",
        ] -> null
      - tags                   = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - tags_all               = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "ManagedBy"                                               = "Terraform"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "Owner"                                                   = "wlevan3"
          - "Project"                                                 = "ml-platform-engineering-practicum"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - version                = "1.34" -> null

      - launch_template {
          - id      = "lt-08fdb290be690713d" -> null
          - name    = "main-2025110708544931700000000b" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 50 -> null
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 4a874979) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251107223704522800000001/1ccd303b-aa7c-5b01-ce41-bd9fb7e5da66" -> null
      - capacity_type          = "SPOT" -> null
      - cluster_name           = "ml-platform-dev" -> null
      - disk_size              = 0 -> null
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251107223704522800000001" -> null
      - instance_types         = [
          - "t3.medium",
          - "t3a.medium",
          - "t2.medium",
        ] -> null
      - labels                 = {
          - "node-lifecycle" = "spot"
        } -> null
      - node_group_name        = "ml-platform-dev-ng-20251107223704522800000001" -> null
      - node_group_name_prefix = "ml-platform-dev-ng-" -> null
      - node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251107084424450100000003" -> null
      - region                 = "us-west-2" -> null
      - release_version        = "1.34.1-20251103" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251107223704522800000001-1ccd303b-aa7c-5b01-ce41-bd9fb7e5da66"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-06381a8f015282e7e",
          - "subnet-069b47da28fb709ea",
          - "subnet-0a662ceb577046bab",
        ] -> null
      - tags                   = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - tags_all               = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "ManagedBy"                                               = "Terraform"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "Owner"                                                   = "wlevan3"
          - "Project"                                                 = "ml-platform-engineering-practicum"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - version                = "1.34" -> null

      - launch_template {
          - id      = "lt-08fdb290be690713d" -> null
          - name    = "main-2025110708544931700000000b" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 50 -> null
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 59924ca9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_ARM_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251108010030574800000001/facd307d-5352-ae9d-920a-7eef10170b0e" -> null
      - capacity_type          = "SPOT" -> null
      - cluster_name           = "ml-platform-dev" -> null
      - disk_size              = 0 -> null
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251108010030574800000001" -> null
      - instance_types         = [
          - "t4g.medium",
          - "t4g.small",
          - "t4g.large",
        ] -> null
      - labels                 = {
          - "node-lifecycle" = "spot"
        } -> null
      - node_group_name        = "ml-platform-dev-ng-20251108010030574800000001" -> null
      - node_group_name_prefix = "ml-platform-dev-ng-" -> null
      - node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251107084424450100000003" -> null
      - region                 = "us-west-2" -> null
      - release_version        = "1.34.1-20251103" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251108010030574800000001-facd307d-5352-ae9d-920a-7eef10170b0e"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-06381a8f015282e7e",
          - "subnet-069b47da28fb709ea",
          - "subnet-0a662ceb577046bab",
        ] -> null
      - tags                   = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - tags_all               = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "ManagedBy"                                               = "Terraform"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "Owner"                                                   = "wlevan3"
          - "Project"                                                 = "ml-platform-engineering-practicum"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - version                = "1.34" -> null

      - launch_template {
          - id      = "lt-08fdb290be690713d" -> null
          - name    = "main-2025110708544931700000000b" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 50 -> null
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 9b4c2fc3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_ARM_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251107232722194000000001/84cd3052-b08c-a28f-9042-e4bdaf2c041f" -> null
      - capacity_type          = "SPOT" -> null
      - cluster_name           = "ml-platform-dev" -> null
      - disk_size              = 0 -> null
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251107232722194000000001" -> null
      - instance_types         = [
          - "t4g.medium",
          - "t4g.small",
          - "t4g.large",
        ] -> null
      - labels                 = {
          - "node-lifecycle" = "spot"
        } -> null
      - node_group_name        = "ml-platform-dev-ng-20251107232722194000000001" -> null
      - node_group_name_prefix = "ml-platform-dev-ng-" -> null
      - node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251107084424450100000003" -> null
      - region                 = "us-west-2" -> null
      - release_version        = "1.34.1-20251103" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251107232722194000000001-84cd3052-b08c-a28f-9042-e4bdaf2c041f"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-06381a8f015282e7e",
          - "subnet-069b47da28fb709ea",
          - "subnet-0a662ceb577046bab",
        ] -> null
      - tags                   = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - tags_all               = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "ManagedBy"                                               = "Terraform"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "Owner"                                                   = "wlevan3"
          - "Project"                                                 = "ml-platform-engineering-practicum"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - version                = "1.34" -> null

      - launch_template {
          - id      = "lt-08fdb290be690713d" -> null
          - name    = "main-2025110708544931700000000b" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 50 -> null
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object a6609c63) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_ARM_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251107100719811900000001/74cd2ee4-75bd-b63e-fd75-54b7417b29b7" -> null
      - capacity_type          = "SPOT" -> null
      - cluster_name           = "ml-platform-dev" -> null
      - disk_size              = 0 -> null
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251107100719811900000001" -> null
      - instance_types         = [
          - "t4g.medium",
          - "t4g.small",
          - "t4g.large",
        ] -> null
      - labels                 = {
          - "node-lifecycle" = "spot"
        } -> null
      - node_group_name        = "ml-platform-dev-ng-20251107100719811900000001" -> null
      - node_group_name_prefix = "ml-platform-dev-ng-" -> null
      - node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251107084424450100000003" -> null
      - region                 = "us-west-2" -> null
      - release_version        = "1.34.1-20251103" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251107100719811900000001-74cd2ee4-75bd-b63e-fd75-54b7417b29b7"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-06381a8f015282e7e",
          - "subnet-069b47da28fb709ea",
          - "subnet-0a662ceb577046bab",
        ] -> null
      - tags                   = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - tags_all               = {
          - "Cluster"                                                 = "ml-platform-dev"
          - "Environment"                                             = "dev"
          - "ManagedBy"                                               = "Terraform"
          - "Name"                                                    = "ml-platform-dev-ng"
          - "Owner"                                                   = "wlevan3"
          - "Project"                                                 = "ml-platform-engineering-practicum"
          - "k8s.io/cluster-autoscaler/node-template/label/lifecycle" = "spot"
        } -> null
      - version                = "1.34" -> null

      - launch_template {
          - id      = "lt-08fdb290be690713d" -> null
          - name    = "main-2025110708544931700000000b" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 50 -> null
        }
    }

Plan: 5 to add, 3 to change, 6 to destroy.

Warning: Deprecated attribute

  on ../../modules/networking/vpc-endpoints.tf line 47, in resource "aws_vpc_endpoint" "ecr_api":
  47:   service_name        = "com.amazonaws.${data.aws_region.current.name}.ecr.api"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Run**: [#19189147019](https://github.com/wlevan3/ml-platform-engineering-practicum/actions/runs/19189147019)
